module.exports = {
	// You can customize the language here
	autoUpdateThreadInfo: {},
	checkwarn: {
		text: {
			warn: "العضو %1 تم تحذيره ثلاث مراة و تم طرده\n- إسمه: %1\n- آيديه: %2\n- ",
			needPermission: "البوت يحتاج أدمن المجموعة لطرد المحضورين ✅"
		}
	},
	leave: {
		text: {
			session1: "صباحا",
			session2: "مساءا",
			session3: "بعدالمساء",
			session4: "ليلا",
			leaveType1: "غادر مجموعة",
			leaveType2: "تم طرده"
		}
	},
	logsbot: {
		text: {
			title: "====== إشعار البوت ======",
			added: "\n✅\nالحدث: تم إضافة البوت لمجموعة جديدة\n- أضافه: %1",
			kicked: "\n❌\nالحدث: تم طرد البوت من مجموعة\n- طرده: %1",
			footer: "\n- صاحب الآيدي: %1\n- مجموعة: %2\n- بوكس آيدي: %3\n- الساعة: %4"
		}
	},
	onEvent: {},
	welcome: {
		text: {
			session1: "صباحك",
			session2: "مسائك",
			session3: "إفطارك",
			session4: "جيبك و فلوسك",
			welcomeMessage: "=================\nتم توصيل البوت بنجاح في المجموعة 😌❤️\nالقواعد 😬:\n1-ممنوع السبام 🙎‍♂️[إرسال رسائل بسرعة]\nمثال:-ارسال رمز البوت بكثرة ❌\n-إرسال نفس الأمر بكثرة ❌\n-إضافة ردود كثيرة في المجموعة ❌\n-كل هذا يجعلك تحضر من البوت ❌\n-السبام هو جعل البوت يرسل رسائل كثيرة ✅ ممنوع❌\n===\n2-ممنوع مراسلة المطور لسبب تافه 😒\nمثال:-إستعمال أمر إتصال لإزعاج المطور ❌\n-الذهاب للمطور خاص و قول له علمني كيف أصنع بوت 🙎‍♂️❌\n===\n3-ممنوع تسوي ثغرات في البوت 😐\nمثال:-تكتشف عيب في البوت يعطيك أفضلية و تستغله جليتشات [إذا لقيت عيب أو خلل قل للمطور] ❤️\n===\n4-ممنوع إستعمال البوت في مجموعة فيها بوت آخر 😐❌\n-5 ممنوع سب البوت أو سب المطور ❌😒\n=======إرشادات======\nحساب صانع البوت 🙂❤️:\n-https:/www.facebook.com/mohamed.allou.90226\n==\n-https:/www.facebook.com/roro.sa.35513\n❌❌❌مخالفة القانون يحضر البوت من المجموعة و يحضر مخالف القانون❌❌❌\nعزيزي الأدمن في هذه المجموعة إقرأ القواعد و إذا وجدت مخالف حذره إذا أردت أن أستمر بالبقاء في مجموعتك\n=================\n𝗥𝗘𝗔𝗗 𝗧𝗛𝗜𝗦❌♻️😐\nأدرس القواعد جيدا من فضلك 😬♻️❤️\nشكرا على إضافتي أحبكم كلكم 🌝🌝❤️",
			multiple1: "بك",
			multiple2: "بكم"
		}
	}
};