module.exports = {
  config: {
    name: "ادعيه",
    version: "1.0",
    author: "AceGun",
    countDown: 5,
    role: 0,
    shortDescription: {
      vi: "",
      en: "يرسل ادعية."
    },
    longDescription: {
      vi: "",
      en: "Sends a random phrase."
    },
    category: "fun",
    guide: {
      en: "{prefix}phrase"
    },
    envConfig: {}
  },

  onStart: async function ({ message }) {
    const phrases = ["\nاللهم إني أخاف الموت على غفلة وأخاف ظلمة القبر اللهم اهدي قلبي واغفر لي وارحمني وأحسن خاتمتي يارب إن كان يومي قريب وقبضت روحي فخفف عليّ سكرات الموت اللهم سخر لي من يدعو لي بعد موتي دون ملل وأحسن خاتمتيُ وارحمني إذا حان موتي.", 
"اللهم ربنا لك الحمد، ملء السماوات وملء الأرض، وملء ما شئت من شيء بعد أهل الثناء والمجد، لا مانع لما أعطيت، ولا معطي لما منعت ولا ينفع ذا الجد منك الجد”. أخرجه مسلم.", "أستغفرك عدد ما غلبتني نفسي ياالله\nأستغفرك ربي حتى ترضى عني\nأستغفرك ربي خضوعأ لك\nأستغفرك ربي تعلقأ بك\nأستغفرك ربي طلبأ لمغفرتك\nأستغفرك ربي شوقأ الى جنتك\nأستغفرك ربي حين تلهينأ الدنيا عن ذكرك\nأستغفرك الله العظيم الذي لا إله إلّا هوالحي القيوم واتوب إليه عدد خلقه ورضا نفسه وزنه عرشه ومداد كلماته 🍂📿", 
"اللهم إنى نويت أن أصوم رمضان كاملا لوجهك الكريم إيماناً واحتساباً، اللهم تقبله مني واجعل ذنبي مغفورًا وصومي مقبولاً", 
"اللهمَّ إني أسألُك العفوَ والعافيةَ، في الدنيا والآخرةِ، اللهمَّ إني أسألُك العفوَ والعافيةَ، في دِيني ودنيايَ وأهلي ومالي، اللهمَّ استُرْ عوراتي، وآمِنْ روعاتي، واحفظني من بين يدي، ومن خلفي، وعن يميني، وعن شمالي، ومن فوقي، وأعوذُ بك أن أُغْتَالَ من تحتي", 
"اللهم إني أعوذ بك من قلب لا يخشع، ومن دعاء لا يسمع، ومن نفس لا تشبع، ومن علم لا ينفع، اللهم إني أعوذ بك من هؤلاء الأربع.",
  "اللهم لا تسلمني إلى عدوٍ يؤذيني، ولا إلى صديق يرديني، وارزقني رزقاً حلالاً يغنيني",
  "اللهم إني أعوذ بك من شر سمعي ومن شر بصري ومن شر لساني ومن شر قلبي",
  "اللهم إني أسالك عيشاً قاراً، ورزقاً داراً، وعملاً باراً.",
  "اللهم إني أسالك عيشاً قاراً، ورزقاً داراً، وعملاً",
  "اللهم كما صنت وجهي عن السجود إلا لك، فصنه عن الحاجة إلا إليك، واجعل يدي العليا بالإعطاء، ولا تجعلها السفلى بالاستعطاء، إنك ترزق من تشاء.",
  "اللهم فقهني في الدين، وعلمني التأويل.",
  "إلهي كيف يمنعني ذنبي من الدعاء، ولا أراك تمنع مع الذنب من العطاء، فالتوبة إليك، والمغفرة لديك، ولا إله إلا أنت، ظلمت نفسي، واعترفت بذنبي، فاغفر لي فإنه لا يغفر الذنوب إلا أنت.",
  "إلهي كيف يمنعني ذنبي من الدعاء، ولا أراك تمنع مع الذنب من العطاء، فالتوبة إليك، والمغفرة لديك، ولا إله إلا أنت، ظلمت نفسي، واعترفت بذنبي، فاغفر لي فإنه لا يغفر الذنوب إلا أنت.",
  "اللهم ثبت في الخيرات وطأتي، ونفس بعد الموت كربتي، وبارك لي في مصيري ومنقلبي، ولا تخفر ذمتي، يا غاية رغبتي.",
  "اللهم اكفني بحلالك عن حرامك، وأغنني بفضلك عمن سواك",
  "اللهم فقهني في الدين، وعلمني التأويل.",
  "اللهم إني أعوذ بك من عقوق الأبناء، ومن قطيعة الأقرباء، ومن جفوة الأحياء، ومن تغير الأصدقاء.",
  "اللهم عافني في روحي وفي جسدي، وفي قلبي وفي بدني، وفي صحتي وفي قوتي، وعافني في دنياي وآخرتي.",
  "اللهم أقل عثراتنا، واغفر زلاتنا، وكفر عنا سيئاتنا، وتوفنا مع الأبرار، يا عزيز يا غفار.",
  "اللهم زدنا ولا تنقصنا، وأكرمنا ولا تهنا، وأعطنا ولا تحرمنا، وآثرنا ولا تؤثر علينا، وأرضنا وارض عنا.",
  "اللهم توفنا مسلمين، وأحينا مسلمين، وألحقنا بالصالحين، غير خزايا ولا مفتونين.",
  "اللهم توفنا مسلمين، وأحينا مسلمين، وألحقنا بالصالحين، غير خزايا ولا مفتونين.",
  "اللهم حبب إلينا الإيمان وزينه في قلوبنا، وكره إلينا الكفر والفسوق والعصيان، واجعلنا من الراشدين.",
  "اللهم إني أسالك إيماناً لا يرتد، ونعيماً لا ينفد، ومرافقة محمد (صلى الله عليه وسلم) في أعلى جنة الخلد.",
  "اللهم إني أسالك أن ترفع ذكري، وتضع وزري، وتصلح أمري، وتغفر لي ذنبي.",
  "اللهم إني أسالك يا ألله بأنك الواحد الأحد الصمد، الذي لم يلد ولم يولد، ولم يكن له كفواً أحد، أن تغفر لي ذنوبي، إنك أنت الغفور الرحيم", 
       ];
    const phrase = phrases[Math.floor(Math.random() * phrases.length)];

    message.reply({
      body: phrase, 
    });
  }
};
