module.exports = {
    config: {
        name: "القوانين",
        version: "1.1",
        author: " ",
        countDown: 5,
        role: 0,
        shortDescription: "فقط أكتب القوانين في الشات و إقرأ 😐",
        longDescription: "🌝",
        category: "ردود",
    },
onStart: async function(){}, 
onChat: async function({
    event,
    message,
    getLang
}) {
    if (event.body && event.body.toLowerCase() == "القوانين") return message.reply("=================\nقوانين البوت 😌❤️\nالقواعد 😬:\n1-ممنوع السبام 🙎‍♂️[إرسال رسائل بسرعة]\nمثال:-ارسال رمز البوت بكثرة ❌\n-إرسال نفس الأمر بكثرة ❌\n-إضافة ردود كثيرة في المجموعة ❌\n-كل هذا يجعلك تحضر من البوت ❌\n-السبام هو جعل البوت يرسل رسائل كثيرة ✅ ممنوع❌\n===\n2-ممنوع مراسلة المطور لسبب تافه 😒\nمثال:-إستعمال أمر إتصال لإزعاج المطور ❌\n-الذهاب للمطور خاص و قول له علمني كيف أصنع بوت 🙎‍♂️❌\n===\n3-ممنوع تسوي ثغرات في البوت 😐\nمثال:-تكتشف عيب في البوت يعطيك أفضلية و تستغله جليتشات [إذا لقيت عيب أو خلل قل للمطور] ❤️\n===\n4-ممنوع إستعمال البوت في مجموعة فيها بوت آخر 😐❌\n-5 ممنوع سب البوت أو سب المطور ❌😒\n=======إرشادات======\nحساب صانع البوت 🙂❤️:\n-www.facebook.com/100093222913818\n==\n❌❌❌مخالفة القانون يحضر البوت من المجموعة و يحضر مخالف القانون❌❌❌\nعزيزي الأدمن في هذه المجموعة إقرأ القواعد و إذا وجدت مخالف حذره إذا أردت أن أستمر بالبقاء في مجموعتك\n=================\n❌♻️😐\nأدرس القواعد جيدا من فضلك 😬♻️❤️\nشكرا على إضافتي أحبكم كلكم 🌝🌝❤️!❤️");
}
};